In [2]:
import pandas as pd

In [3]:
bank_client_df = pd.DataFrame({'Bank Client ID':[111, 222, 333, 444],
                               'Bank Client Name':['Laila Aly','Kate','Nicole','Francis'],
                               'Net Worth [$]':[35000,3000,100000,2000],
                               'Years with Bank':[4,7,10,15]})

bank_client_df

   Bank Client ID Bank Client Name  Net Worth [$]  Years with Bank
0             111        Laila Aly          35000                4
1             222             Kate           3000                7
2             333           Nicole         100000               10
3             444          Francis           2000               15

In [14]:
cm = pd.read_csv("C:/Users/rlaeo/OneDrive/바탕 화면/Customers.csv")

In [22]:
cm.to_csv('sample_output_index.csv',index=False) #csv로 내보내기
cm

,CustomerID,Gender,Age,AnnualIncome,SpendingScore,Profession,WorkExperience,FamilySize
0,1,Male,19,15000,39,Healthcare,1,4
1,2,Male,21,35000,81,Engineer,3,3
2,3,Female,20,86000,6,Engineer,1,1
3,4,Female,23,59000,77,Lawyer,0,2
4,5,Female,31,38000,40,Entertainment,2,6
...,...,...,...,...,...,...,...,...
1995,1996,Female,71,184387,40,Artist,8,7
1996,1997,Female,91,73158,32,Doctor,7,7
1997,1998,Male,87,90961,14,Healthcare,9,2
1998,1999,Male,77,182109,4,Executive,7,2
1999,2000,Male,90,110610,52,Entertainment,5,2

In [25]:
cm = pd.read_csv("C:/Users/rlaeo/OneDrive/바탕 화면/Customers.csv")
cm.set_index('CustomerID',inplace= True)#index 설정 
cm

,Gender,Age,AnnualIncome,SpendingScore,Profession,WorkExperience,FamilySize
CustomerID,,,,,,,
1,Male,19,15000,39,Healthcare,1,4
2,Male,21,35000,81,Engineer,3,3
3,Female,20,86000,6,Engineer,1,1
4,Female,23,59000,77,Lawyer,0,2
5,Female,31,38000,40,Entertainment,2,6
...,...,...,...,...,...,...,...
1996,Female,71,184387,40,Artist,8,7
1997,Female,91,73158,32,Doctor,7,7
1998,Male,87,90961,14,Healthcare,9,2
1999,Male,77,182109,4,Executive,7,2
2000,Male,90,110610,52,Entertainment,5,2

In [27]:
cm.reset_index(inplace = True) #초기화
cm

,index,CustomerID,Gender,Age,AnnualIncome,SpendingScore,Profession,WorkExperience,FamilySize
0,0,1,Male,19,15000,39,Healthcare,1,4
1,1,2,Male,21,35000,81,Engineer,3,3
2,2,3,Female,20,86000,6,Engineer,1,1
3,3,4,Female,23,59000,77,Lawyer,0,2
4,4,5,Female,31,38000,40,Entertainment,2,6
...,...,...,...,...,...,...,...,...,...
1995,1995,1996,Female,71,184387,40,Artist,8,7
1996,1996,1997,Female,91,73158,32,Doctor,7,7
1997,1997,1998,Male,87,90961,14,Healthcare,9,2
1998,1998,1999,Male,77,182109,4,Executive,7,2
1999,1999,2000,Male,90,110610,52,Entertainment,5,2

In [32]:
cm = pd.read_csv("C:/Users/rlaeo/OneDrive/바탕 화면/Customers.csv",index_col='CustomerID')
cm#index로 사용

,Gender,Age,AnnualIncome,SpendingScore,Profession,WorkExperience,FamilySize
CustomerID,,,,,,,
1,Male,19,15000,39,Healthcare,1,4
2,Male,21,35000,81,Engineer,3,3
3,Female,20,86000,6,Engineer,1,1
4,Female,23,59000,77,Lawyer,0,2
5,Female,31,38000,40,Entertainment,2,6
...,...,...,...,...,...,...,...
1996,Female,71,184387,40,Artist,8,7
1997,Female,91,73158,32,Doctor,7,7
1998,Male,87,90961,14,Healthcare,9,2
1999,Male,77,182109,4,Executive,7,2
2000,Male,90,110610,52,Entertainment,5,2

In [37]:
age = cm["Age"]
age
#cm.Age도 같은값 출력

CustomerID
1       19
2       21
3       20
4       23
5       31
        ..
1996    71
1997    91
1998    87
1999    77
2000    90
Name: Age, Length: 2000, dtype: int64

In [40]:
sample = cm[['Age','AnnualIncome']] #2개 이상
sample

            Age  AnnualIncome
CustomerID
1            19         15000
2            21         35000
3            20         86000
4            23         59000
5            31         38000
...         ...           ...
1996         71        184387
1997         91         73158
1998         87         90961
1999         77        182109
2000         90        110610

[2000 rows x 2 columns]

In [45]:
column = ['Age','AnnualIncome'] #뽑아쓰기
sample = cm[column]
sample

            Age  AnnualIncome
CustomerID
1            19         15000
2            21         35000
3            20         86000
4            23         59000
5            31         38000
...         ...           ...
1996         71        184387
1997         91         73158
1998         87         90961
1999         77        182109
2000         90        110610

[2000 rows x 2 columns]

In [65]:
#cm.insert(0,column='credit score',value=[680, ...])등으로 원하는 위치 삽입가능
#del cm['create score']
#cm.drop(labels = ['Age','anything'],axis = 1,inplace = True) 두개이상 제거 axis = 0은 행방향 axis = 1은 열방향
#fm = cm.pop('Age') #데이터 따로 가져오기
cm

,Gender,Age,AnnualIncome,SpendingScore,Profession,WorkExperience,FamilySize
CustomerID,,,,,,,
1,Male,19,15000,39,Healthcare,1,4
2,Male,21,35000,81,Engineer,3,3
3,Female,20,86000,6,Engineer,1,1
4,Female,23,59000,77,Lawyer,0,2
5,Female,31,38000,40,Entertainment,2,6
...,...,...,...,...,...,...,...
1996,Female,71,184387,40,Artist,8,7
1997,Female,91,73158,32,Doctor,7,7
1998,Male,87,90961,14,Healthcare,9,2
1999,Male,77,182109,4,Executive,7,2
2000,Male,90,110610,52,Entertainment,5,2

In [70]:
#cm.loc[1] #특정 index출력 1개일때 텍스트 출력
#cm.loc[1:3] 2개이상일때 데이터프레임으로 출력

In [73]:
cm.loc[[1,2,3]] #다른 방법으로 출력

,Gender,Age,AnnualIncome,SpendingScore,Profession,WorkExperience,FamilySize
CustomerID,,,,,,,
1,Male,19,15000,39,Healthcare,1,4
2,Male,21,35000,81,Engineer,3,3
3,Female,20,86000,6,Engineer,1,1

In [74]:
cm.sample(n=5,axis=0) #랜덤으로 행 가져오기

,Gender,Age,AnnualIncome,SpendingScore,Profession,WorkExperience,FamilySize
CustomerID,,,,,,,
821,Female,78,79677,9,Artist,10,7
114,Male,19,2000,46,Artist,1,1
1979,Male,84,104589,85,Artist,10,2
1020,Female,99,145777,94,Executive,1,5
1411,Female,38,120825,24,Executive,9,7